mycases/cylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (20 0 0);

boundaryField
{

    inlet
    {
    	type  		fixedValue;
    	value 		$internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    upperAndLower
    {
        type            noSlip;
    }

    cylinderGroup
    {
        type            noSlip;
    }

    frontAndBack
    {
    	type 		empty;
    }

}


// ************************************************************************* //
